{"Pomfrey": {"abstract": "Madam Poppy Pomfrey was the matron at Hogwarts School of Witchcraft and Wizardry. She was a very competent nurse, having been in the position for, at least, the last quarter of the 20th century. Madam Pomfrey was very possessive of the patients in her care while in the Hospital Wing and their visitors upset her somewhat, as she frequently insisted they must rest. She was proficient in her area of expertise (healing magic) and can take care of some ailments \"in a heartbeat\". She fought in the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/5/56/Madam_Pomfrey.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1176/window-height/1176?cb=20131110073338", "title": "Poppy Pomfrey"}, "Slytherins": {"abstract": "Slytherin is one of the four Houses at Hogwarts School of Witchcraft and Wizardry, founded by Salazar Slytherin. In establishing the house, Salazar instructed the Sorting Hat to pick students who had a few particular characteristics he most valued. Those characteristics include: cunning, resourcefulness, and ambition. The founder highly valued and favoured pure-blood students and the Sorting Hat admitted that it can be a factor when being Sorted. Students of any blood status can now be...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/8d/SalazarSlytherin.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/289/window-height/289?cb=20131117024104", "title": "Slytherin"}, "Harry Potter": {"abstract": "Harry James Potter (b. 31 July, 1980) was a half-blood wizard, one of the most famous wizards of modern times. He was the only child and son of James and Lily Potter (née Evans), both members of the original Order of the Phoenix. Harry's birth was overshadowed by a prophecy, naming either himself or Neville Longbottom as the one with the power to vanquish Lord Voldemort. After half of the prophecy was reported to Voldemort courtesy of Severus Snape, Harry was chosen as the target due to his...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/a/a9/Dhharryroomhighreso.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1000/window-height/1000?cb=20160722220125", "title": "Harry Potter"}, "Dursley": {"abstract": "The Dursley family is a Muggle family, and the only known living close relatives of Harry Potter. Petunia Dursley (née Evans) was the older sister of Harry's mother, Lily Potter (née Evans), but took the surname Dursley when she married Vernon Dursley. They had a son named Dudley. Harry Potter's aunt and uncle met at work. Petunia Evans, forever embittered by the fact that her parents seemed to value her witch sister more than they valued her, left Cokeworth forever to pursue a typing course...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/87/DursleyFamily.jpg/revision/latest/window-crop/width/200/x-offset/131/y-offset/0/window-width/727/window-height/726?cb=20170310050024", "title": "Dursley family"}, "Fang": {"abstract": "Fang (1984) was an over-sized boarhound dog, and one of Rubeus Hagrid's pets. He was a large dog that accompanied Hagrid in many places, including the Forbidden Forest, and lived in his hut. Fang was present for the majority of the Second Wizarding War, such as the Battle of the Astronomy Tower and the Battle of Hogwarts. It's currently unknown what happened to Fang after the Second Wizarding War, but since his name wasn't listed amongst the casualties, it can be assumed he survived.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/f/f5/Fang_OOTP.png/revision/latest/window-crop/width/200/x-offset/174/y-offset/0/window-width/860/window-height/859?cb=20161205013847", "title": "Fang"}, "Norris": {"abstract": "Mrs Norris is the pet cat of Argus Filch, the caretaker of Hogwarts School of Witchcraft and Wizardry. Mrs Norris is described as having an unusually strong connection with her master, alerting him to any students misbehaving inside the school grounds. She is described as appearing almost the same way as Filch, with bulging yellow, lamp-like eyes, a scrawny, skeletal body and dust-coloured fur. Harry Potter, Ron Weasley, and Hermione Granger often narrowly escaped the cat on their nightly...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/40/Mrs_Norris_PM_Illust.jpg/revision/latest/window-crop/width/200/x-offset/105/y-offset/0/window-width/373/window-height/372?cb=20170206182008", "title": "Mrs Norris"}, "Norbert": {"abstract": "Norberta, originally Norbert, (b. Spring 1992) was a Norwegian Ridgeback Dragon hatched by Rubeus Hagrid in his hut at Hogwarts School of Witchcraft and Wizardry. During the 1991–1992 school year, Professor Quirinus Quirrell, trying to figure out how to get past Fluffy and retrieve the Philosopher's Stone, disguised himself and enticed Hagrid to play a game of cards by wagering Norberta's egg. They had a few drinks, and Quirrell asked him if he was sure he could handle raising a dragon...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/d/d4/Norbert_WB_F1_ConceptOfAYoungNorbert_Illust_080615_.LandTIF.jpg/revision/latest/window-crop/width/200/x-offset/177/y-offset/0/window-width/2137/window-height/2136?cb=20161122220257", "title": "Norberta"}, "Wood": {"abstract": "Oliver Wood (born c.1975 or 1976) was a Scottish wizard who was the Keeper and Captain for the Gryffindor Quidditch team. He attended Hogwarts School of Witchcraft and Wizardry from 1987 to 1994. Oliver was known for his determination and skill on the playing field, and his long lectures before practises. He led the Gryffindor team to victory in the Quidditch Cup in his seventh year. After leaving school, Oliver joined Puddlemere United as a reserve player (presumably as Keeper). In 1998...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2f/Oliver_WoodDH2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/793/window-height/793?cb=20110801072255", "title": "Oliver Wood"}, "Quirrell": {"abstract": "Professor Quirinus Quirrell (26 September, 1972 or earlier – 4 June, 1992) was a half-blood wizard who attended Hogwarts School of Witchcraft and Wizardry and was sorted into Ravenclaw House. He was the Muggle Studies professor at Hogwarts, though he later became the Defence Against the Dark Arts professor during the 1991–1992 school year. Before teaching Defence Against the Dark Arts, Quirrell went out in search of Voldemort, believing he could achieve recognition for finding him and could...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/e/ed/%D0%9A%D0%B2%D0%B8%D1%80%D1%80%D0%B5%D0%BB%D0%BB.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1101/window-height/1101?cb=20170731155558", "title": "Quirinus Quirrell"}, "Fred Weasley": {"abstract": "Fred Weasley (1 April, 1978 – 2 May, 1998) was a pure-blood wizard, a son of Arthur Weasley and Molly Weasley (née Prewett), brother to Bill, Charlie, Percy, Ron, and Ginny Weasley, and twin brother to George Weasley. Fred's first few years were marked by the height of the First Wizarding War and when Lord Voldemort fell for the first time. He attended Hogwarts School of Witchcraft and Wizardry from 1989-1996 and was sorted into Gryffindor House. Both he and his twin brother were popular...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/9/90/Fred_HS_TDH_promo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1024/window-height/1024?cb=20161119235258", "title": "Fred Weasley"}, "Goyle": {"abstract": "Mr Goyle was a wizard, Death Eater, husband of Mrs Goyle and the father of Gregory. Goyle fought during the First Wizarding War. He didn't search for Lord Voldemort after his first downfall, but this was forgiven in 1995, after Voldemort's return at the Little Hangleton graveyard, in which Goyle was present. Goyle possibly fought at several battles of the Second Wizarding War, including the Battle of Hogwarts. After the battle and Voldemort's final defeat, Goyle was presumably killed or...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2c/Goyledad.JPG/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/392/window-height/392?cb=20100214191032", "title": "Goyle"}, "Severus Snape": {"abstract": "Professor Severus Snape (9 January, 1960 – 2 May, 1998) was a half-blood wizard serving as Potions Master (1981-1996), Defence Against the Dark Arts professor (1996-1997), and Headmaster (1997-1998) of the Hogwarts School of Witchcraft and Wizardry as well as a member of the Order of the Phoenix and a Death Eater. His double life played a extremely important role in both of the Wizarding Wars against Voldemort. The only child of Muggle lowlife Tobias Snape and Gobstones witch Eileen Snape...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/a/a3/Severus_Snape.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/491/window-height/491?cb=20150307193047", "title": "Severus Snape"}, "Longbottom": {"abstract": "Longbottom is the surname of a pure-blood wizarding family, and one of the Sacred Twenty-Eight. They are related to the Black and Abbott families, and more distantly to the Weasley, Crouch and Potter families. Most Longbottoms do not appear to hold prejudice based on blood purity, although there are indications that they are considered more respectable than the Weasleys. For example, Callidora Black was not disowned by her family for marrying Harfang Longbottom, implying that he was not...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/00/Longbottomfamilytree-pottermore.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1346/window-height/1346?cb=20170726173150", "title": "Longbottom family"}, "Ravenclaw": {"abstract": "Ravenclaw is one of the four Houses of Hogwarts School of Witchcraft and Wizardry, founded by Rowena Ravenclaw. Members of this house are characterised by their wit, learning, and wisdom. Its house colours are blue and bronze, and its symbol is an eagle. The house ghost, who in life was the daughter of the house's founder Rowena Ravenclaw, is the Grey Lady. Ravenclaw corresponds roughly to the element of air; the House colours blue and bronze were chosen to represent the sky and eagle...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/3/31/Rowena_Ravenclaw_WWHP.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/406/window-height/406?cb=20100814073544", "title": "Ravenclaw"}, "Crabbe": {"abstract": "Mr Crabbe was a wizard, a Death Eater, and the father of Vincent Crabbe. Mr Crabbe was born into the Crabbe family, possibly as a relative of Irma Crabbe, member of the House of Black.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/b/b8/Crabbesnr2.PNG/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/506/window-height/506?cb=20100214192235", "title": "Crabbe"}, "Nicolas Flamel": {"abstract": "Nicolas Flamel (before 1327 – between 1992 and 1996) was a well-known alchemist and only known maker of the Philosopher's Stone, a legendary substance with incredible powers. He was a close friend and partner with former Hogwarts School Headmaster Albus Dumbledore. He owed his considerable age to the Elixir of Life. He and his wife Perenelle created this Elixir using the Stone. He was six hundred and ninety years old as of 1992. In his youth, Nicolas attended Beauxbatons Academy of Magic in...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/7/78/Nicolas_Flamel.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/248/window-height/248?cb=20130617023626", "title": "Nicolas Flamel"}, "Hermione Granger": {"abstract": "Minister Hermione Jean Granger (b. 19 September, 1979) was a Muggle-born witch born to Mr and Mrs Granger, both dentists. At the age of eleven she learned that she was a witch, and had been accepted into Hogwarts School of Witchcraft and Wizardry. She began attending Hogwarts in 1991 and was Sorted into Gryffindor House. Hermione possessed a brilliant academic mind, and proved to be a gifted student in almost every subject that she studied. Hermione first met Harry Potter and Ron Weasley...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/41/Hermionedhface.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1535/window-height/1535?cb=20161221044857", "title": "Hermione Granger"}, "Hufflepuff": {"abstract": "Hufflepuff is one of the four Houses of Hogwarts School of Witchcraft and Wizardry. Its founder was the medieval witch Helga Hufflepuff. Hufflepuff is the most inclusive among the four houses; valuing hard work, dedication, patience, loyalty, and fair play rather than a particular aptitude in its members. The emblematic animal is a badger, and yellow and black are its colours. The Head of Hufflepuff is Pomona Sprout and the Fat Friar is the House's patron ghost. Hufflepuff corresponds...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/7/77/Wallofportraits2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/305/window-height/305?cb=20130511204011", "title": "Hufflepuff"}, "Ron Weasley": {"abstract": "Ronald Bilius \"Ron\" Weasley (b. 1 March, 1980) was a pure-blood wizard, the sixth and youngest son of Arthur and Molly Weasley (née Prewett). He was also the younger brother of Bill, Charlie, Percy, Fred, George, and the elder brother of Ginny. Ron and his brothers and sister lived at the Burrow, on the outskirts of Ottery St Catchpole. Ron began attending Hogwarts School of Witchcraft and Wizardry in 1991 and was Sorted into Gryffindor House. He soon became best friends with fellow student...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/46/Trio_meet.jpg/revision/latest/window-crop/width/200/x-offset/481/y-offset/0/window-width/794/window-height/793?cb=20160215161419", "title": "Ronald Weasley"}, "Seamus Finnigan": {"abstract": "Seamus Finnigan (b. 1979/1980) was a half-blood wizard, son of Muggle Mr Finnigan and Irish witch Mrs Finnigan. Mr Finnigan did not learn this until after they were married and it gave him a \"nasty shock\" when he first learned it. Seamus was a Gryffindor student at Hogwarts School of Witchcraft and Wizardry. He was also the best friend of Dean Thomas. Seamus originally doubted Harry Potter's claim that Lord Voldemort had returned in 1995 (as his mother doubted it). However, late in 1995 he...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/9/9c/Seamus_FinniganDH2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/375/window-height/375?cb=20170729174316", "title": "Seamus Finnigan"}, "Figg": {"abstract": "Mrs Arabella Doreen Figg was a Squib, a dealer of cross-bred cats and kneazles, and a member of the Order of the Phoenix. She lived on Wisteria Walk in Little Whinging, in a house that smelled strongly of cabbage; she also owned and extensively photographed at least four part-kneazle cats, named Mr Tibbles, Snowy, Mr Paws and Tufty. She lived near Harry Potter and the Dursley family, and used to babysit Harry in the 1980s and the early 1990s, mainly to keep an eye on him for Albus...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/82/Figg.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/340/window-height/340?cb=20080102062404", "title": "Arabella Figg"}, "Bane": {"abstract": "Bane was a centaur living as part of the Forbidden Forest Centaur colony. Late in May of 1992, Bane and Firenze foretold Harry Potter's future by reading the stars; “Remember, Firenze, we are sworn not to set ourselves against the heavens. Have you not read what is to come in the movement of the planets?”. He also chastised Firenze questioning if he was a common mule as he carried Harry Potter on his back. Bane was included in the centaur mobs that forced Harry, Hermione Granger, and Rubeus...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/86/08.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/203/window-height/203?cb=20100712171001", "title": "Bane"}, "Jordan": {"abstract": "Jordan is the surname of a wizarding family. Family members Mr Jordan — Lee Jordan's father., Lee Jordan — a Gryffindor student at Hogwarts in the 1990s and member of Dumbledore's Army.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/44/LeeJordan.jpg/revision/latest/window-crop/width/200/x-offset/42/y-offset/0/window-width/241/window-height/240?cb=20060702232708", "title": "Jordan family"}, "Lee Jordan": {"abstract": "Lee Jordan (b. 1977/1978) was a wizard, son of Mr and Mrs Jordan, and a Gryffindor student at Hogwarts School of Witchcraft and Wizardry from 1989 to 1996 (a couple of years before Harry). During his years at Hogwarts, he became best friends with Fred and George Weasley and liked doing pranks with them. He often helped them work on their inventions and tricks, some of which were eventually sold at Weasleys' Wizard Wheezes. Lee also served as a Quidditch Commentator during his Hogwarts years...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/5/57/Leejordan_OoTP.PNG/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/216/window-height/216?cb=20160829050615", "title": "Lee Jordan"}, "Granger": {"abstract": "Mr Granger (temporarily known as Wendell Wilkins) was a Muggle, the husband of Mrs Granger, and father of Hermione Jean Granger. Working as a dentist alongside his wife, he and his family lived in a house located on the outskirts of London. He and his wife were proud and accepting of their daughter's identity as a witch, which explained some strange things which happened around her when she was a child. They entered the magical world in 1992 to buy Hermione's school supplies, and were...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/5/5f/Hermione_Granger%27s_father.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/316/window-height/316?cb=20160712040549", "title": "Hermione Granger's father"}, "Neville Longbottom": {"abstract": "Professor Neville Longbottom (b. 30 July, 1980) was a pure-blood wizard, the only child and son of Frank and Alice Longbottom. Neville's parents were well-respected Aurors and members of the original Order of the Phoenix, until they were tortured into insanity by Bellatrix Lestrange and 3 other Death Eaters with the Cruciatus Curse when he was about sixteen months old. They were placed in the Janus Thickey Ward at St Mungo's Hospital for Magical Maladies and Injuries, leaving Neville to be...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/04/Harry-potter-and-the-deathly-hallowspart-2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/600/window-height/600?cb=20161120035218", "title": "Neville Longbottom"}, "Uncle Vernon": {"abstract": "Vernon Dursley was a Muggle, husband of Petunia Evans, father of Dudley and uncle of Harry Potter by marriage. He used to live at 4 Privet Drive along with his wife and son for nearly twenty years until they were forced into hiding during the escalation of the Second Wizarding War. After Petunia's sister Lily and brother-in-law, James Potter, were killed by Voldemort in their own home, Petunia remained the sole surviving blood relative of Harry's. Both Wizard and Muggle law demanded that...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/20/Vernon_Dursley.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1051/window-height/1051?cb=20160121162004", "title": "Vernon Dursley"}, "Ronan": {"abstract": "Ronan was a centaur who lived in the Forbidden Forest, and was distrustful of humans, although he tried to protect Harry Potter and Hermione Granger from the other centaurs in 1996, pointing out that they were \"foals\". He was described as speaking with a doleful tone, and seemed rather peaceful compared to other centaurs. He led the charge of the centaurs from the Forbidden Forest during the Battle of Hogwarts, breaking through the Death Eater ranks into the Great Hall. It is likely that he...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/b/ba/CentaursHagrid.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/347/window-height/347?cb=20070912091824", "title": "Ronan"}, "George Weasley": {"abstract": "George Weasley (b. 1 April, 1978) was a pure-blood wizard, son of Arthur Weasley and Molly Weasley (née Prewett), brother of Bill, Charlie, Percy, Ron, and Ginny, and twin brother of the late Fred Weasley. George's first few years were marked by the height of the First Wizarding War and Lord Voldemort's first fall. He attended Hogwarts School of Witchcraft and Wizardry from 1989-1996 with Fred, and was Sorted into Gryffindor House. He and Fred were popular students, becoming Beaters for the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2a/George_HS_TDH_promo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/960/window-height/960?cb=20161119235305", "title": "George Weasley"}, "Charlie Weasley": {"abstract": "Charles \"Charlie\" Weasley (b. 12 December, 1972) was the second eldest son of Arthur and Molly Weasley (née Prewett), younger brother of Bill Weasley and the elder brother of Percy, George, Ron, Ginny Weasley, and the late Fred Weasley. He attended Hogwarts School of Witchcraft and Wizardry from 1984-1991 and was sorted into Gryffindor House. He was both a Prefect and Quidditch Captain during his time at school, after which he went to study dragons in Romania. During the Second Wizarding...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/d/d0/Charlie_PM.jpg/revision/latest/scale-to-width-down/200?cb=20170625194046", "title": "Charles Weasley"}, "Percy Weasley": {"abstract": "Percy Ignatius Weasley (b. 22 August, 1976) was a pure-blood wizard, the third child of Arthur and Molly Weasley (née Prewett). He was the younger brother of Bill and Charlie and the older brother of Ron, Ginny, George, and the late Fred Weasley. He attended Hogwarts School of Witchcraft and Wizardry from 1987-1994, and was both a prefect and Head Boy. He took the rules very seriously, and did not believe that Fred and George Weasley would get very far with their jokes. It was also once...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/b/bc/Percy_WeasleyDH.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/240/window-height/240?cb=20160720032549", "title": "Percy Weasley"}, "Dumbledore": {"abstract": "Professor Albus Percival Wulfric Brian Dumbledore, O.M. (First Class), Grand Sorc., D. Wiz., X.J. (sorc.), S. of Mag.Q. (c. Summer 1881 – 30 June, 1997) was the Transfiguration Professor, and later Headmaster of Hogwarts School of Witchcraft and Wizardry. Professor Dumbledore also served as Supreme Mugwump of the International Confederation of Wizards (?–1995) and Chief Warlock of the Wizengamot (?-1995; 1996-1997). He was a half-blood, Muggle-supporting wizard, the son of Percival and...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/40/Albus_Dumbledore_%28HBP_promo%29_3.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/2136/window-height/2136?cb=20150822232849", "title": "Albus Dumbledore"}, "Voldemort": {"abstract": "Tom Marvolo Riddle (31 December, 1926 – 2 May, 1998 ), later (and better) known as Lord Voldemort, was a half-blood wizard considered to have been the most powerful and dangerous dark wizard of all time. The only child and son of wealthy Muggle gentleman Tom and Merope Riddle (née Gaunt) via the coercive use of a Love Potion, Riddle was raised in the Muggle-run Wool's Orphanage after his father abandoned his new family on the streets of London when the potion's influence was lifted, and his...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/6e/VoldemortHeadshot_DHP1.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1200/window-height/1200?cb=20161203031453", "title": "Tom Riddle"}, "Malfoy": {"abstract": "Malfoy is the surname of a wealthy pure-blood wizarding family and one of the Sacred Twenty-Eight. They live in Malfoy Manor in Wiltshire, England. The Malfoys are related to many other pure-blood families, including the: Blacks, Lestranges, Greengrasses, and Rosiers. They are also related to the Tonks and Lupin families, of mixed wizarding and Muggle heritage, much to the Malfoys' disdain, although they are not against marrying half-bloods. The Malfoys gained a reputation for pure-blood...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/a/a5/Malfoy_family_crest2.jpg/revision/latest/window-crop/width/200/x-offset/16/y-offset/0/window-width/380/window-height/379?cb=20110711145927", "title": "Malfoy family"}, "Minerva Mcgonagall": {"abstract": "Professor Minerva McGonagall, O.M. (First Class), (b. 4 October, 1935) was a half-blood witch, the only daughter of Muggle Robert McGonagall and witch Isobel Ross. She had two younger brothers, Malcolm and Robert Jr. Minerva was a registered Animagus who attended Hogwarts School of Witchcraft and Wizardry from 1947-1954 and was Sorted into Gryffindor House (but it took the sorting hat 5 ½ minutes to decide if she was Gryffindor or Ravenclaw, therefore making her a Hatstall). After her...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/24/McGonagall_dh2.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/398/window-height/398?cb=20170829161459", "title": "Minerva McGonagall"}, "Albus Dumbledore": {"abstract": "Professor Albus Percival Wulfric Brian Dumbledore, O.M. (First Class), Grand Sorc., D. Wiz., X.J. (sorc.), S. of Mag.Q. (c. Summer 1881 – 30 June, 1997) was the Transfiguration Professor, and later Headmaster of Hogwarts School of Witchcraft and Wizardry. Professor Dumbledore also served as Supreme Mugwump of the International Confederation of Wizards (?–1995) and Chief Warlock of the Wizengamot (?-1995; 1996-1997). He was a half-blood, Muggle-supporting wizard, the son of Percival and...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/40/Albus_Dumbledore_%28HBP_promo%29_3.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/2136/window-height/2136?cb=20150822232849", "title": "Albus Dumbledore"}, "Hooch": {"abstract": "Madam Rolanda Hooch (b. before 1918) was a witch who worked as the Flying instructor, Quidditch referee, and coach at Hogwarts School of Witchcraft and Wizardry. Madam Hooch likely attended the school as a student and was probably a member of her House's Quidditch team. She learnt to fly on her own Silver Arrow broomstick sometime before or during the Great War and returned to Hogwarts for a job. While on staff at Hogwarts Hooch worked under Headmasters Albus Dumbledore, Dolores Umbridge...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/02/RolandaHooch.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1028/window-height/1028?cb=20100616193052", "title": "Rolanda Hooch"}, "Flitwick": {"abstract": "Professor Filius Flitwick (b. 17 October 1958 or earlier) was a part-goblin, part-wizard who attended Hogwarts School of Witchcraft and Wizardry and was sorted into Ravenclaw House, being an intelligent young man and a model student. Some time after his graduation, Flitwick returned to Hogwarts and became the Charms Master, as well as the Head of Ravenclaw House. During the First and Second Wizarding Wars, Flitwick opposed Lord Voldemort. In 1995, he also opposed Dolores Umbridge, the High...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/4b/Flitwickarmourbattle.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/368/window-height/368?cb=20110628141204", "title": "Filius Flitwick"}, "Gringotts": {"abstract": "Gringotts Wizarding Bank is the only bank of the wizarding world, and is owned and operated by goblins. It was created by a goblin called Gringott, in 1474. Its main offices are located around the North Side of Diagon Alley in London, England. In addition to storing money and valuables for wizards and witches, one can go there to exchange Muggle money for wizarding money. The currency exchanged by Muggles is later returned to circulation in the Muggle world by goblins. According to Rubeus...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/9/96/GringottsLogoDH.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/598/window-height/598?cb=20130314200534", "title": "Gringotts Wizarding Bank"}, "Rubeus Hagrid": {"abstract": "Professor Rubeus Hagrid (b. 6 December 1928) was a half-giant wizard, son of Mr Hagrid and the giantess Fridwulfa, and elder half-brother of the giant Grawp. Hagrid attended Hogwarts School of Witchcraft and Wizardry in 1940 and was sorted into Gryffindor house. In Hagrid's third year, he was framed by Tom Riddle for the crime of opening the Chamber of Secrets and using his pet Acromantula to attack several Muggle-born students and eventually killing one of them. Though Hagrid's wand was...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/e/ee/Rubeushagrid.PNG/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1651/window-height/1651?cb=20161123044204", "title": "Rubeus Hagrid"}, "Malkin": {"abstract": "Madam Malkin was the owner of Madam Malkin's Robes for All Occasions. She was a squat witch dressed all in mauve who was very friendly, unless anyone displayed signs of aggression in her shop. In early 1992, Madam Malkin went to Paris for the Which Witch? fashion show, and left her shop closed with a notice outside.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/0b/MadamMalkin.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/306/window-height/306?cb=20110923214536", "title": "Malkin"}, "Finnigan": {"abstract": "Finnigan is the surname of an Irish Muggle family, though they now have some magical blood, since one family member married a witch; their son Seamus is also a wizard. Finnigan is a fairly common Irish surname. Finnegan's Wake is a popular comedic Irish ballad, as well as the basis for the title of James Joyce's Finnegans Wake.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/d/d0/Seamus_poa.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/290/window-height/290?cb=20050817015318", "title": "Finnigan family"}, "Potter": {"abstract": "Potter is the surname of an old wizarding family descended from Ignotus Peverell and Linfred of Stinchcombe. They were once pure-bloods, but James Potter married Muggle-born witch Lily Evans, thus their son Harry James Potter was half-blood. The Potters have traditionally been sorted into Gryffindor House at Hogwarts School of Witchcraft and Wizardry; they are also very wealthy, with a vault at Gringotts Wizarding Bank containing a great deal of gold. During the First and Second Wizarding...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1f/Potter_family1.png/revision/latest/window-crop/width/200/x-offset/93/y-offset/0/window-width/318/window-height/317?cb=20140628034720", "title": "Potter family"}, "Dean Thomas": {"abstract": "Dean Thomas (b. 1979/1980) was a half-blood wizard, the son of a wizard and a Muggle. When Dean Thomas was very young, his father died and his mother married another man, giving Dean several half-siblings. Since Dean's father never told his mother that he was a wizard and was eventually murdered by Death Eaters when he refused to join them, Dean grew up thinking he was Muggle-born. Dean was a Gryffindor student at Hogwarts School of Witchcraft and Wizardry. He was in the same year as the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1e/HPDH2-1500.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/536/window-height/536?cb=20180204001353", "title": "Dean Thomas"}, "Griphook": {"abstract": "Griphook was a goblin who worked at Gringotts Wizarding Bank in Diagon Alley. He would later go on the run during the height of the Second Wizarding War following the fall of the Ministry of Magic and the raise of Lord Voldemort's new regime. He would later assist Harry Potter in his break-in of Gringotts in order to obtain Helga Hufflepuff's Cup. Griphook worked for Gringotts Wizarding Bank. In 1991, he took Harry Potter and Rubeus Hagrid to vaults 687 and 713. This was the first time Harry...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/5/53/Griphook_TDH_SF.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/838/window-height/838?cb=20161215062124", "title": "Griphook"}, "Dudley Dursley": {"abstract": "Dudley Dursley (b. 23 June, 1980) was the Muggle son of Vernon and Petunia Dursley and cousin of Harry Potter. He was obese and insolent as a result of his parents spoiling him throughout his childhood, although he became muscular in his teens. He and his gang often tormented Harry, taking after the example set by his parents, as well as other weaker and younger children in their neighbourhood and at school. In 1995, he faced Dementors for the first time and was saved by Harry, after which...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/67/DudleyDH.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/270/window-height/270?cb=20160830004111", "title": "Dudley Dursley"}, "Slytherin": {"abstract": "Slytherin is one of the four Houses at Hogwarts School of Witchcraft and Wizardry, founded by Salazar Slytherin. In establishing the house, Salazar instructed the Sorting Hat to pick students who had a few particular characteristics he most valued. Those characteristics include: cunning, resourcefulness, and ambition. The founder highly valued and favoured pure-blood students and the Sorting Hat admitted that it can be a factor when being Sorted. Students of any blood status can now be...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/8d/SalazarSlytherin.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/289/window-height/289?cb=20131117024104", "title": "Slytherin"}, "Petunia": {"abstract": "Petunia Dursley (née Evans) (c. 1960 – c. 2020) was a Muggle, the elder daughter of Mr. and Mrs Evans and the sister of the Muggle-born witch Lily. During her childhood, she broke off contact with her sister and refused to have any contact with the wizarding world. She married a Muggle, Vernon Dursley and they had a son, Dudley. However, when Lily was murdered by Voldemort, Petunia became guardian of her nephew, Harry Potter, who was only an infant then. She neglected him for the most part...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/64/Petunia_DH1.png/revision/latest/scale-to-width-down/200?cb=20170829160604", "title": "Petunia Dursley"}, "Draco Malfoy": {"abstract": "Draco Lucius Malfoy (b. 5 June, 1980) was a pure-blood wizard and the only son of Lucius and Narcissa Malfoy (née Black). The son of a Death Eater, Draco was raised to believe strongly in the importance of blood purity. He attended Hogwarts School of Witchcraft and Wizardry from 1991-1998 and was sorted into Slytherin House. During his years at Hogwarts, he became friends with Vincent Crabbe, Gregory Goyle, Pansy Parkinson, and other fellow Slytherins, but he quickly developed a rivalry with...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/c/cf/Harry-Potter-The-Deathly-Hallows-Part-II.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/860/window-height/860?cb=20140602031803", "title": "Draco Malfoy"}, "Ollivander": {"abstract": "Garrick Ollivander (b. 25 September, pre 1908) was the proprietor of Ollivanders in Diagon Alley during most of the 20th century. Ollivander was widely considered the best wandmaker in the world, and many wizards and witches buy their wands from him. In 1996 Ollivander was captured and tortured by Lord Voldemort. He was rescued in 1998 by: Harry Potter, Ron Weasley, Hermione Granger, and Dobby. He imparted important information regarding wandlore to Harry, it helped him in his understanding...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/68/GarrickOllivander.png/revision/latest/scale-to-width-down/200?cb=20180127182338", "title": "Garrick Ollivander"}}