{"Pomfrey": {"abstract": "Madam Poppy Pomfrey was the matron at Hogwarts School of Witchcraft and Wizardry. She was a very competent nurse, having been in the position for, at least, the last quarter of the 20th century. Madam Pomfrey was very possessive of the patients in her care while in the Hospital Wing and their visitors upset her somewhat, as she frequently insisted they must rest. She was proficient in her area of expertise (healing magic) and can take care of some ailments \"in a heartbeat\". She fought in the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/5/56/Madam_Pomfrey.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1176/window-height/1176?cb=20131110073338", "title": "Poppy Pomfrey"}, "McGonagall": {"abstract": "Professor Minerva McGonagall, O.M. (First Class), (b. 4 October, 1935) was a half-blood witch, the only daughter of Muggle Robert McGonagall and witch Isobel Ross. She had two younger brothers, Malcolm and Robert Jr. Minerva was a registered Animagus who attended Hogwarts School of Witchcraft and Wizardry from 1947-1954 and was Sorted into Gryffindor House (but it took the sorting hat 5 ½ minutes to decide if she was Gryffindor or Ravenclaw, therefore making her a Hatstall). After her...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/24/McGonagall_dh2.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/398/window-height/398?cb=20170829161459", "title": "Minerva McGonagall"}, "Harry Potter": {"abstract": "Harry James Potter (b. 31 July, 1980) was a half-blood wizard, one of the most famous wizards of modern times. He was the only child and son of James and Lily Potter (née Evans), both members of the original Order of the Phoenix. Harry's birth was overshadowed by a prophecy, naming either himself or Neville Longbottom as the one with the power to vanquish Lord Voldemort. After half of the prophecy was reported to Voldemort courtesy of Severus Snape, Harry was chosen as the target due to his...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/a/a9/Dhharryroomhighreso.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1000/window-height/1000?cb=20160722220125", "title": "Harry Potter"}, "Ginny Weasley": {"abstract": "Ginevra Molly \"Ginny\" Potter (neé Weasley; b. 11 August, 1981), occasionally known as Gin, was a pure-blood witch, the youngest of Arthur and Molly Weasley's (née Prewett) seven children, and the first female to be born into the Weasley line for several generations. She and her older brothers grew up in the Burrow on the outskirts of Ottery St Catchpole in Devon. Ginny attended Hogwarts School of Witchcraft and Wizardry from 1992-1999 and was sorted into Gryffindor House. During her first...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/8b/Ginny_Weasley_hbp_promo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/540/window-height/540?cb=20180322181904", "title": "Ginevra Weasley"}, "Norris": {"abstract": "Mrs Norris is the pet cat of Argus Filch, the caretaker of Hogwarts School of Witchcraft and Wizardry. Mrs Norris is described as having an unusually strong connection with her master, alerting him to any students misbehaving inside the school grounds. She is described as appearing almost the same way as Filch, with bulging yellow, lamp-like eyes, a scrawny, skeletal body and dust-coloured fur. Harry Potter, Ron Weasley, and Hermione Granger often narrowly escaped the cat on their nightly...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/40/Mrs_Norris_PM_Illust.jpg/revision/latest/window-crop/width/200/x-offset/105/y-offset/0/window-width/373/window-height/372?cb=20170206182008", "title": "Mrs Norris"}, "Creevey": {"abstract": "Creevey is the surname of a Muggle family. However, they proved to have some distant wizarding blood, as Colin and Dennis Creevey both turned out to be Muggle-born wizards. Known family members Colin Creevey — a Muggle-born wizard sorted into Gryffindor house and a member of Dumbledore's Army; killed during the Battle of Hogwarts, Dennis Creevey — Colin's younger brother, also a Muggle-born wizard sorted into Gryffindor house and a member of Dumbledore's Army, Mr Creevey — a milkman and...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/6c/Colin_promo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/330/window-height/330?cb=20100405141852", "title": "Creevey family"}, "Mason": {"abstract": "Mr Mason was a rich builder from whom Vernon Dursley was hoping to get a big drill order in 1992. On 31 July, Mr Mason and his wife were dinner guests at the Dursley home. The evening was nearly ruined when the dessert Petunia Dursley had made, crashed to the floor (an incident blamed on Harry Potter, though it was actually Dobby's fault). The evening could have been rescued were it not for the barn owl that flew through the open window and dropped a letter on Mrs Mason’s head. Mr Mason then...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/7/75/Mr.Mason.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/333/window-height/333?cb=20080903173250", "title": "Mason"}, "Arthur Weasley": {"abstract": "Arthur Weasley (b. 6 February, 1950) was a pure-blood wizard in the employ of the Ministry of Magic, as well as a member of the second Order of the Phoenix. He was a staunch believer in the equality of all magical and Muggle folk and was the head of the Weasley family. Arthur was born to Septimus and Cedrella Weasley (née Black) and had at least two brothers. He attended Hogwarts School of Witchcraft and Wizardry from 1961-1968 and was sorted into Gryffindor house. Soon after graduating...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/00/AWeasley1.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/540/window-height/540?cb=20150828155106", "title": "Arthur Weasley"}, "Colin Creevey": {"abstract": "Colin Creevey (1981 – 2 May, 1998) was a Muggle-born wizard, son of Mr Creevey and Mrs Creevey, and older brother of Dennis. He was a big fan of the famous Harry Potter, who was a year ahead of him in school. During his first year at Hogwarts School of Witchcraft and Wizardry, he was sorted into Gryffindor House. He was known for taking several pictures of Harry and other students. During his fourth year, he and Dennis became members of Dumbledore's Army, an organisation taught and led by...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/13/CCreeveyOP.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/338/window-height/338?cb=20110829161704", "title": "Colin Creevey"}, "Millicent Bulstrode": {"abstract": "Millicent Bulstrode (b. 1979/1980) was a half-blood witch. She began attending Hogwarts School of Witchcraft and Wizardry and was sorted into Slytherin House in 1991. In her fifth year she became a member of the short-lived Inquisitorial Squad led by Dolores Umbridge. Millicent Bulstrode was born sometime between 1 September 1979 and 31 August 1980 into the pure-blooded, Sacred Twenty-Eight Bulstrode family, though was herself a half-blood. She may have been related to Violetta Black (née...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/f/f5/HP2-0143.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/221/window-height/221?cb=20141228194856", "title": "Millicent Bulstrode"}, "Dudley Dursley": {"abstract": "Dudley Dursley (b. 23 June, 1980) was the Muggle son of Vernon and Petunia Dursley and cousin of Harry Potter. He was obese and insolent as a result of his parents spoiling him throughout his childhood, although he became muscular in his teens. He and his gang often tormented Harry, taking after the example set by his parents, as well as other weaker and younger children in their neighbourhood and at school. In 1995, he faced Dementors for the first time and was saved by Harry, after which...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/67/DudleyDH.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/270/window-height/270?cb=20160830004111", "title": "Dudley Dursley"}, "Tom Riddle": {"abstract": "Tom Marvolo Riddle (31 December, 1926 – 2 May, 1998 ), later (and better) known as Lord Voldemort, was a half-blood wizard considered to have been the most powerful and dangerous dark wizard of all time. The only child and son of wealthy Muggle gentleman Tom and Merope Riddle (née Gaunt) via the coercive use of a Love Potion, Riddle was raised in the Muggle-run Wool's Orphanage after his father abandoned his new family on the streets of London when the potion's influence was lifted, and his...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/6e/VoldemortHeadshot_DHP1.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1200/window-height/1200?cb=20161203031453", "title": "Tom Riddle"}, "Fred Weasley": {"abstract": "Fred Weasley (1 April, 1978 – 2 May, 1998) was a pure-blood wizard, a son of Arthur Weasley and Molly Weasley (née Prewett), brother to Bill, Charlie, Percy, Ron, and Ginny Weasley, and twin brother to George Weasley. Fred's first few years were marked by the height of the First Wizarding War and when Lord Voldemort fell for the first time. He attended Hogwarts School of Witchcraft and Wizardry from 1989-1996 and was sorted into Gryffindor House. Both he and his twin brother were popular...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/9/90/Fred_HS_TDH_promo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1024/window-height/1024?cb=20161119235258", "title": "Fred Weasley"}, "Goyle": {"abstract": "Mr Goyle was a wizard, Death Eater, husband of Mrs Goyle and the father of Gregory. Goyle fought during the First Wizarding War. He didn't search for Lord Voldemort after his first downfall, but this was forgiven in 1995, after Voldemort's return at the Little Hangleton graveyard, in which Goyle was present. Goyle possibly fought at several battles of the Second Wizarding War, including the Battle of Hogwarts. After the battle and Voldemort's final defeat, Goyle was presumably killed or...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2c/Goyledad.JPG/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/392/window-height/392?cb=20100214191032", "title": "Goyle"}, "Ron Weasley": {"abstract": "Ronald Bilius \"Ron\" Weasley (b. 1 March, 1980) was a pure-blood wizard, the sixth and youngest son of Arthur and Molly Weasley (née Prewett). He was also the younger brother of Bill, Charlie, Percy, Fred, George, and the elder brother of Ginny. Ron and his brothers and sister lived at the Burrow, on the outskirts of Ottery St Catchpole. Ron began attending Hogwarts School of Witchcraft and Wizardry in 1991 and was Sorted into Gryffindor House. He soon became best friends with fellow student...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/46/Trio_meet.jpg/revision/latest/window-crop/width/200/x-offset/481/y-offset/0/window-width/794/window-height/793?cb=20160215161419", "title": "Ronald Weasley"}, "Longbottom": {"abstract": "Longbottom is the surname of a pure-blood wizarding family, and one of the Sacred Twenty-Eight. They are related to the Black and Abbott families, and more distantly to the Weasley, Crouch and Potter families. Most Longbottoms do not appear to hold prejudice based on blood purity, although there are indications that they are considered more respectable than the Weasleys. For example, Callidora Black was not disowned by her family for marrying Harfang Longbottom, implying that he was not...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/00/Longbottomfamilytree-pottermore.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1346/window-height/1346?cb=20170726173150", "title": "Longbottom family"}, "Hermione Granger": {"abstract": "Minister Hermione Jean Granger (b. 19 September, 1979) was a Muggle-born witch born to Mr and Mrs Granger, both dentists. At the age of eleven she learned that she was a witch, and had been accepted into Hogwarts School of Witchcraft and Wizardry. She began attending Hogwarts in 1991 and was Sorted into Gryffindor House. Hermione possessed a brilliant academic mind, and proved to be a gifted student in almost every subject that she studied. Hermione first met Harry Potter and Ron Weasley...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/41/Hermionedhface.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1535/window-height/1535?cb=20161221044857", "title": "Hermione Granger"}, "Hufflepuff": {"abstract": "Hufflepuff is one of the four Houses of Hogwarts School of Witchcraft and Wizardry. Its founder was the medieval witch Helga Hufflepuff. Hufflepuff is the most inclusive among the four houses; valuing hard work, dedication, patience, loyalty, and fair play rather than a particular aptitude in its members. The emblematic animal is a badger, and yellow and black are its colours. The Head of Hufflepuff is Pomona Sprout and the Fat Friar is the House's patron ghost. Hufflepuff corresponds...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/7/77/Wallofportraits2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/305/window-height/305?cb=20130511204011", "title": "Hufflepuff"}, "Fang": {"abstract": "Fang (1984) was an over-sized boarhound dog, and one of Rubeus Hagrid's pets. He was a large dog that accompanied Hagrid in many places, including the Forbidden Forest, and lived in his hut. Fang was present for the majority of the Second Wizarding War, such as the Battle of the Astronomy Tower and the Battle of Hogwarts. It's currently unknown what happened to Fang after the Second Wizarding War, but since his name wasn't listed amongst the casualties, it can be assumed he survived.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/f/f5/Fang_OOTP.png/revision/latest/window-crop/width/200/x-offset/174/y-offset/0/window-width/860/window-height/859?cb=20161205013847", "title": "Fang"}, "Seamus Finnigan": {"abstract": "Seamus Finnigan (b. 1979/1980) was a half-blood wizard, son of Muggle Mr Finnigan and Irish witch Mrs Finnigan. Mr Finnigan did not learn this until after they were married and it gave him a \"nasty shock\" when he first learned it. Seamus was a Gryffindor student at Hogwarts School of Witchcraft and Wizardry. He was also the best friend of Dean Thomas. Seamus originally doubted Harry Potter's claim that Lord Voldemort had returned in 1995 (as his mother doubted it). However, late in 1995 he...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/9/9c/Seamus_FinniganDH2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/375/window-height/375?cb=20170729174316", "title": "Seamus Finnigan"}, "Snape": {"abstract": "Professor Severus Snape (9 January, 1960 – 2 May, 1998) was a half-blood wizard serving as Potions Master (1981-1996), Defence Against the Dark Arts professor (1996-1997), and Headmaster (1997-1998) of the Hogwarts School of Witchcraft and Wizardry as well as a member of the Order of the Phoenix and a Death Eater. His double life played a extremely important role in both of the Wizarding Wars against Voldemort. The only child of Muggle lowlife Tobias Snape and Gobstones witch Eileen Snape...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/a/a3/Severus_Snape.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/491/window-height/491?cb=20150307193047", "title": "Severus Snape"}, "Neville Longbottom": {"abstract": "Professor Neville Longbottom (b. 30 July, 1980) was a pure-blood wizard, the only child and son of Frank and Alice Longbottom. Neville's parents were well-respected Aurors and members of the original Order of the Phoenix, until they were tortured into insanity by Bellatrix Lestrange and 3 other Death Eaters with the Cruciatus Curse when he was about sixteen months old. They were placed in the Janus Thickey Ward at St Mungo's Hospital for Magical Maladies and Injuries, leaving Neville to be...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/04/Harry-potter-and-the-deathly-hallowspart-2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/600/window-height/600?cb=20161120035218", "title": "Neville Longbottom"}, "Uncle Vernon": {"abstract": "Vernon Dursley was a Muggle, husband of Petunia Evans, father of Dudley and uncle of Harry Potter by marriage. He used to live at 4 Privet Drive along with his wife and son for nearly twenty years until they were forced into hiding during the escalation of the Second Wizarding War. After Petunia's sister Lily and brother-in-law, James Potter, were killed by Voldemort in their own home, Petunia remained the sole surviving blood relative of Harry's. Both Wizard and Muggle law demanded that...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/20/Vernon_Dursley.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1051/window-height/1051?cb=20160121162004", "title": "Vernon Dursley"}, "Oliver Wood": {"abstract": "Oliver Wood (born c.1975 or 1976) was a Scottish wizard who was the Keeper and Captain for the Gryffindor Quidditch team. He attended Hogwarts School of Witchcraft and Wizardry from 1987 to 1994. Oliver was known for his determination and skill on the playing field, and his long lectures before practises. He led the Gryffindor team to victory in the Quidditch Cup in his seventh year. After leaving school, Oliver joined Puddlemere United as a reserve player (presumably as Keeper). In 1998...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2f/Oliver_WoodDH2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/793/window-height/793?cb=20110801072255", "title": "Oliver Wood"}, "Gilderoy Lockhart": {"abstract": "Professor Gilderoy Lockhart, O.M. (Third Class), (b. 26 January, 1964) was a half-blood wizard, a Ravenclaw student at Hogwarts School of Witchcraft and Wizardry, and later a famous wizarding celebrity who authored many books on dark creatures and his encounters with them. Prior to his tenure as Professor of Defence Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry during the 1992–1993 school year, he received many prestigious awards, such as Order of Merlin, Third Class...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1a/Kenneth_Branagh_as_Gilderoy-Lockhart_%286%29.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/383/window-height/383?cb=20100123194408", "title": "Gilderoy Lockhart"}, "Errol": {"abstract": "Errol (f. 1992 - 1994) was one of the Weasley family's owls. He was a Great Grey Owl, or Strix nebulosa. He was described by Harry Potter as resembling a moulting feather duster. Errol was also described as ancient, and as such his poor eyesight caused him to hit objects in flight. Errol delivered Harry's first birthday present from Ron before his third year at Hogwarts. He lost consciousness during both long and short journeys. He often stayed with Harry's owl Hedwig to regain consciousness...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/e/e4/Errol_PM.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/2231/window-height/2230?cb=20170117132530", "title": "Errol"}, "Percy Weasley": {"abstract": "Percy Ignatius Weasley (b. 22 August, 1976) was a pure-blood wizard, the third child of Arthur and Molly Weasley (née Prewett). He was the younger brother of Bill and Charlie and the older brother of Ron, Ginny, George, and the late Fred Weasley. He attended Hogwarts School of Witchcraft and Wizardry from 1987-1994, and was both a prefect and Head Boy. He took the rules very seriously, and did not believe that Fred and George Weasley would get very far with their jokes. It was also once...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/b/bc/Percy_WeasleyDH.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/240/window-height/240?cb=20160720032549", "title": "Percy Weasley"}, "George Weasley": {"abstract": "George Weasley (b. 1 April, 1978) was a pure-blood wizard, son of Arthur Weasley and Molly Weasley (née Prewett), brother of Bill, Charlie, Percy, Ron, and Ginny, and twin brother of the late Fred Weasley. George's first few years were marked by the height of the First Wizarding War and Lord Voldemort's first fall. He attended Hogwarts School of Witchcraft and Wizardry from 1989-1996 with Fred, and was Sorted into Gryffindor House. He and Fred were popular students, becoming Beaters for the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2a/George_HS_TDH_promo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/960/window-height/960?cb=20161119235305", "title": "George Weasley"}, "Nick": {"abstract": "Nick Shirm portrayed Zacharias Smith in the film and video game adaptations of Harry Potter and the Order of the Phoenix. He was credited as \"Slightly Doubtful Boy\" in the film. Nick Shirm is currently training as an opera singer at the Guildhall School of Music and Drama in London and has appeared alongside Harry Potter co star, Helena Bonham Carter in Sixty Six. He has also appeared in the London West End in Chitty Chitty Bang Bang. He is now the singer in London-based band'Manifesto...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/6f/Nick-Shirm-74.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/500/window-height/500?cb=20110623174829", "title": "Nick Shirm"}, "Voldemort": {"abstract": "Tom Marvolo Riddle (31 December, 1926 – 2 May, 1998 ), later (and better) known as Lord Voldemort, was a half-blood wizard considered to have been the most powerful and dangerous dark wizard of all time. The only child and son of wealthy Muggle gentleman Tom and Merope Riddle (née Gaunt) via the coercive use of a Love Potion, Riddle was raised in the Muggle-run Wool's Orphanage after his father abandoned his new family on the streets of London when the potion's influence was lifted, and his...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/6/6e/VoldemortHeadshot_DHP1.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1200/window-height/1200?cb=20161203031453", "title": "Tom Riddle"}, "Dursleys": {"abstract": "The Dursley family is a Muggle family, and the only known living close relatives of Harry Potter. Petunia Dursley (née Evans) was the older sister of Harry's mother, Lily Potter (née Evans), but took the surname Dursley when she married Vernon Dursley. They had a son named Dudley. Harry Potter's aunt and uncle met at work. Petunia Evans, forever embittered by the fact that her parents seemed to value her witch sister more than they valued her, left Cokeworth forever to pursue a typing course...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/87/DursleyFamily.jpg/revision/latest/window-crop/width/200/x-offset/131/y-offset/0/window-width/727/window-height/726?cb=20170310050024", "title": "Dursley family"}, "Headless": {"abstract": "Headless Hats are a magical prank item created by Fred and George Weasley for their shop, Weasleys' Wizard Wheezes. They are small hats covered in pink feathers. When worn, the hat and head of the person wearing it disappears. Although they are good for frightening people, they do not last very long. It works by extending an Invisibility Spell beyond the object itself. This is apparently unusual and advanced magic, as Hermione Granger found it clever and intriguing. The twins charged 2...", "thumbnail": null, "title": "Headless Hat"}, "Patrick Delaney-podmore": {"abstract": "Sir Patrick Delaney-Podmore was a wizard who later became a headless ghost. He is playful and charismatic, and likes to show off in front of other ghosts. He may be related to Order of the Phoenix member Sturgis Podmore. Little is known about Sir Patrick's life. However, we do know that he was beheaded (probably was executed, murdered or had an accident).", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1c/PatrickDelaney-Podmore.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/550/window-height/550?cb=20131019144854", "title": "Patrick Delaney-Podmore"}, "Binns": {"abstract": "Professor Cuthbert Binns was a wizard and History of Magic professor at Hogwarts School of Witchcraft and Wizardry. He owned an office in the main castle and Classroom 4F on the first floor to teach in. He taught until a very old age, when he fell asleep in the staff room and died in slumber. Now, he is a ghost who continued to teach, droning on about various Goblin Rebellions and Giant Wars to bored, sleeping students. Professor Binns's lessons were regarded as some of the most boring at...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/7/70/HistoryofMagic.png/revision/latest/window-crop/width/200/x-offset/1321/y-offset/0/window-width/1501/window-height/1500?cb=20161210024606", "title": "Cuthbert Binns"}, "Aragog": {"abstract": "Aragog (c. 1942–20 April 1997) was an Acromantula owned by Rubeus Hagrid. Like the rest of his species, Aragog had a taste for human flesh and was able to communicate with humans. In his youth, he was the size of a Pekingese and near the end of his life was about the size of a small elephant with an eighteen-foot leg span. Aragog had a wife, Mosag, and was the leader of a large Acromantula colony composed of all of his sons and daughters. During his life, Aragog was accused of being...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/d/d2/Ara.jpg/revision/latest/window-crop/width/200/x-offset/114/y-offset/0/window-width/382/window-height/381?cb=20100611145604", "title": "Aragog"}, "Justin Finch-fletchley": {"abstract": "Justin Finch-Fletchley (b. 1979/1980) was a Muggle-born wizard. He was in the same year as the famous Harry Potter at Hogwarts School of Witchcraft and Wizardry and was sorted into Hufflepuff House in 1991. Justin was a member of Dumbledore's Army, an organisation taught and led by Harry Potter and was good friends with housemates Ernie Macmillan and Hannah Abbott. Unaware of his magical abilities, Justin was headed to the English public school Eton before receiving his letter of admission...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/16/Justin_Finch-Fletchley_%28McGonagall%27s_Class%29_%281%29.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/244/window-height/244?cb=20180308172742", "title": "Justin Finch-Fletchley"}, "Albus Dumbledore": {"abstract": "Professor Albus Percival Wulfric Brian Dumbledore, O.M. (First Class), Grand Sorc., D. Wiz., X.J. (sorc.), S. of Mag.Q. (c. Summer 1881 – 30 June, 1997) was the Transfiguration Professor, and later Headmaster of Hogwarts School of Witchcraft and Wizardry. Professor Dumbledore also served as Supreme Mugwump of the International Confederation of Wizards (?–1995) and Chief Warlock of the Wizengamot (?-1995; 1996-1997). He was a half-blood, Muggle-supporting wizard, the son of Percival and...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/40/Albus_Dumbledore_%28HBP_promo%29_3.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/2136/window-height/2136?cb=20150822232849", "title": "Albus Dumbledore"}, "Hooch": {"abstract": "Madam Rolanda Hooch (b. before 1918) was a witch who worked as the Flying instructor, Quidditch referee, and coach at Hogwarts School of Witchcraft and Wizardry. Madam Hooch likely attended the school as a student and was probably a member of her House's Quidditch team. She learnt to fly on her own Silver Arrow broomstick sometime before or during the Great War and returned to Hogwarts for a job. While on staff at Hogwarts Hooch worked under Headmasters Albus Dumbledore, Dolores Umbridge...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/0/02/RolandaHooch.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1028/window-height/1028?cb=20100616193052", "title": "Rolanda Hooch"}, "Flitwick": {"abstract": "Professor Filius Flitwick (b. 17 October 1958 or earlier) was a part-goblin, part-wizard who attended Hogwarts School of Witchcraft and Wizardry and was sorted into Ravenclaw House, being an intelligent young man and a model student. Some time after his graduation, Flitwick returned to Hogwarts and became the Charms Master, as well as the Head of Ravenclaw House. During the First and Second Wizarding Wars, Flitwick opposed Lord Voldemort. In 1995, he also opposed Dolores Umbridge, the High...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/4/4b/Flitwickarmourbattle.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/368/window-height/368?cb=20110628141204", "title": "Filius Flitwick"}, "Lockhart": {"abstract": "Professor Gilderoy Lockhart, O.M. (Third Class), (b. 26 January, 1964) was a half-blood wizard, a Ravenclaw student at Hogwarts School of Witchcraft and Wizardry, and later a famous wizarding celebrity who authored many books on dark creatures and his encounters with them. Prior to his tenure as Professor of Defence Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry during the 1992–1993 school year, he received many prestigious awards, such as Order of Merlin, Third Class...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1a/Kenneth_Branagh_as_Gilderoy-Lockhart_%286%29.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/383/window-height/383?cb=20100123194408", "title": "Gilderoy Lockhart"}, "Riddle": {"abstract": "Riddle™, or RiddleTM, are a Wizard rock band from Oxfordshire, UK. They are probably most well-known for their song'For Jo', which thanks JK Rowling for the impact she has had on the lives of all Harry Potter fans, and was part of the reason they were mentioned in an article on UK Wizard Rock in The Times newspaper.", "thumbnail": null, "title": "Riddle™"}, "Thomas": {"abstract": "The biological father of Dean Thomas was a wizard who abandoned his Muggle wife and infant son in a courageous effort to protect them from the Death Eaters. He was soon after murdered by the Death Eaters when he refused to join their cause. His widow, who was never told that her husband was a wizard, eventually remarried a Muggle man, who raised Dean as his own son. When Dean realised he was a wizard at age eleven, his mother suspected that her first husband might have also been a wizard...", "thumbnail": null, "title": "Dean Thomas's father"}, "Hagrid": {"abstract": "Professor Rubeus Hagrid (b. 6 December 1928) was a half-giant wizard, son of Mr Hagrid and the giantess Fridwulfa, and elder half-brother of the giant Grawp. Hagrid attended Hogwarts School of Witchcraft and Wizardry in 1940 and was sorted into Gryffindor house. In Hagrid's third year, he was framed by Tom Riddle for the crime of opening the Chamber of Secrets and using his pet Acromantula to attack several Muggle-born students and eventually killing one of them. Though Hagrid's wand was...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/e/ee/Rubeushagrid.PNG/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1651/window-height/1651?cb=20161123044204", "title": "Rubeus Hagrid"}, "Bulstrode": {"abstract": "Millicent Bulstrode (b. 1979/1980) was a half-blood witch. She began attending Hogwarts School of Witchcraft and Wizardry and was sorted into Slytherin House in 1991. In her fifth year she became a member of the short-lived Inquisitorial Squad led by Dolores Umbridge. Millicent Bulstrode was born sometime between 1 September 1979 and 31 August 1980 into the pure-blooded, Sacred Twenty-Eight Bulstrode family, though was herself a half-blood. She may have been related to Violetta Black (née...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/f/f5/HP2-0143.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/221/window-height/221?cb=20141228194856", "title": "Millicent Bulstrode"}, "Hedwig": {"abstract": "Hedwig (d. 27 July, 1997) was Harry Potter's pet Snowy Owl (Bubo scandiacus). Hedwig was an 11th birthday gift from Rubeus Hagrid to Harry. Hagrid purchased her at Eeylops Owl Emporium. In addition to the usual use Owls are put to, delivering mail, Hedwig was also a close companion to Harry. She remained one of his closest friends right up to her death during the Battle of the Seven Potters at the height of the Second Wizarding War.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1e/Hedwig_Snowy_Owl_PM.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/936/window-height/936?cb=20161123234010", "title": "Hedwig"}, "Sprout": {"abstract": "Sprout may refer to: Sprout (food), the shoot of a plant eaten as a vegetable, Pomona Sprout, former professor of Herbology at Hogwarts School of Witchcraft and Wizardry Sprout may refer to: Sprout (owl), an owl who played Hedwig in the film adaptation of Harry Potter and the Philosopher's Stone", "thumbnail": null, "title": "Sprout"}, "Finnigan": {"abstract": "Finnigan is the surname of an Irish Muggle family, though they now have some magical blood, since one family member married a witch; their son Seamus is also a wizard. Finnigan is a fairly common Irish surname. Finnegan's Wake is a popular comedic Irish ballad, as well as the basis for the title of James Joyce's Finnegans Wake.", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/d/d0/Seamus_poa.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/290/window-height/290?cb=20050817015318", "title": "Finnigan family"}, "Fawkes": {"abstract": "Fawkes was a highly intelligent phoenix and Albus Dumbledore's animal companion and defender. It is unknown how long Fawkes has been in Dumbledore's service. He has been Dumbledore's loyal champion for many years prior to the Headmaster's death. Fawkes was instrumental in helping Harry Potter defeat Salazar Slytherin's basilisk in 1993. His tears (which possessed healing properties) saved Harry's life after his arm was punctured by the basilisk's fang. In 1995 Fawkes came to Dumbledore's aid...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/f/f8/Fawkes_WB_F2_FawkesCloseUpIllustration_Illust_100615_Port.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/301/window-height/301?cb=20151218225509", "title": "Fawkes"}, "Alley": {"abstract": "Diagon Alley is a cobblestoned wizarding alley and shopping area located in London, England behind a pub called the Leaky Cauldron. Inside the alley is an assortment of restaurants, shops, and other sights. All items on the Hogwarts supply list can be bought at Diagon Alley. The alley is completely hidden from the Muggle world which is right outside of its boundaries. It is very large in area and essentially the centre of wizarding London. The Leaky Cauldron was present long before Charing...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/9/95/Diagon_Alley_North_Side.png/revision/latest/window-crop/width/200/x-offset/250/y-offset/0/window-width/805/window-height/804?cb=20110917232032", "title": "Diagon Alley"}, "Dean Thomas": {"abstract": "Dean Thomas (b. 1979/1980) was a half-blood wizard, the son of a wizard and a Muggle. When Dean Thomas was very young, his father died and his mother married another man, giving Dean several half-siblings. Since Dean's father never told his mother that he was a wizard and was eventually murdered by Death Eaters when he refused to join them, Dean grew up thinking he was Muggle-born. Dean was a Gryffindor student at Hogwarts School of Witchcraft and Wizardry. He was in the same year as the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/1e/HPDH2-1500.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/536/window-height/536?cb=20180204001353", "title": "Dean Thomas"}, "Wood": {"abstract": "Oliver Wood (born c.1975 or 1976) was a Scottish wizard who was the Keeper and Captain for the Gryffindor Quidditch team. He attended Hogwarts School of Witchcraft and Wizardry from 1987 to 1994. Oliver was known for his determination and skill on the playing field, and his long lectures before practises. He led the Gryffindor team to victory in the Quidditch Cup in his seventh year. After leaving school, Oliver joined Puddlemere United as a reserve player (presumably as Keeper). In 1998...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2f/Oliver_WoodDH2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/793/window-height/793?cb=20110801072255", "title": "Oliver Wood"}, "Dobby": {"abstract": "Dobby (28 June (year unknown) – March, 1998) was a male house-elf who served the Malfoy family. His masters were Dark Wizards who treated him cruelly. In 1992 he disobeyed his masters and tried to warn Harry Potter of the plot to have the Chamber of Secrets reopened. He came to know this via the contact between his masters and Lord Voldemort. At the end of that school year, after Harry had vanquished the memory of Tom Riddle and slayed the basilisk in the Chamber of Secrets, he tricked...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/1/18/DOBBY2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/944/window-height/944?cb=20161215055153", "title": "Dobby"}, "Slytherin": {"abstract": "Slytherin is one of the four Houses at Hogwarts School of Witchcraft and Wizardry, founded by Salazar Slytherin. In establishing the house, Salazar instructed the Sorting Hat to pick students who had a few particular characteristics he most valued. Those characteristics include: cunning, resourcefulness, and ambition. The founder highly valued and favoured pure-blood students and the Sorting Hat admitted that it can be a factor when being Sorted. Students of any blood status can now be...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/8/8d/SalazarSlytherin.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/289/window-height/289?cb=20131117024104", "title": "Slytherin"}, "Finch-Fletchley": {"abstract": "This woman was the mother of Justin Finch-Fletchley. She was a Muggle, and was initially a bit disappointed to have her son attend Hogwarts School of Witchcraft and Wizardry, as before he received his Hogwarts acceptance letter in 1991, he had been registered at Eton College. The following year, Justin made her read Gilderoy Lockhart's books, and she came to appreciate how beneficial it might prove to have a fully-trained wizard in the family. Appearances Harry Potter and the Chamber of...", "thumbnail": null, "title": "Justin Finch-Fletchley's mother"}, "Ernie Macmillan": {"abstract": "Ernest \"Ernie\" Macmillan (b. 1980) was a pure-blood wizard who attended Hogwarts School of Witchcraft and Wizardry from 1991-1998. He was in the same year as the famous Harry Potter and was sorted into Hufflepuff House. He was also born into the Macmillian family, one of the Sacred Twenty-Eight. Ernie was an academically strong student and good friends with Hannah Abbott and Justin Finch-Fletchley. In 1992, Ernie initially suspected that Harry Potter was the Heir of Slytherin during the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/d/de/Ernie_GOF.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/443/window-height/443?cb=20160720043852", "title": "Ernest Macmillan"}, "Salazar Slytherin": {"abstract": "Salazar Slytherin (fl. c. 993—1000) was a pure-blood wizard. Noted for his cunning and determination and regarded as one of the greatest wizards of the age (respectively as a Parselmouth and skilled Legilimens), Slytherin was one of the four founders of Hogwarts School of Witchcraft and Wizardry along with Godric Gryffindor, Helga Hufflepuff and Rowena Ravenclaw, as well as the namesake of the Slytherin House. He didn't trust and was in fact quite disdainful of, Muggle-born students, to the...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/2/2b/PR_007_005-e1313269785740.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/585/window-height/585?cb=20140615154545", "title": "Salazar Slytherin"}, "Draco Malfoy": {"abstract": "Draco Lucius Malfoy (b. 5 June, 1980) was a pure-blood wizard and the only son of Lucius and Narcissa Malfoy (née Black). The son of a Death Eater, Draco was raised to believe strongly in the importance of blood purity. He attended Hogwarts School of Witchcraft and Wizardry from 1991-1998 and was sorted into Slytherin House. During his years at Hogwarts, he became friends with Vincent Crabbe, Gregory Goyle, Pansy Parkinson, and other fellow Slytherins, but he quickly developed a rivalry with...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/c/cf/Harry-Potter-The-Deathly-Hallows-Part-II.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/860/window-height/860?cb=20140602031803", "title": "Draco Malfoy"}, "Lucius Malfoy": {"abstract": "Lucius Malfoy (b. 1953 - 1954) was a pure-blood wizard, and son of Abraxas Malfoy, husband of Narcissa Black and the father of Draco Malfoy. Lucius was educated at Hogwarts, where he was made a prefect in Slytherin House. As an adult, Lucius was an aristocratic wizard and patriarch of the Malfoy family, believing strongly in notions of blood purity and the superiority of pure-blood wizards. He joined the Death Eaters, who shared his views on blood purity, and participated in the First...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/b/b4/Lucius_Malfoy_BoH.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/267/window-height/267?cb=20120622073504", "title": "Lucius Malfoy"}, "Borgin": {"abstract": "Mr Borgin was the co-owner of Borgin and Burkes, a shop in Knockturn Alley which bought and sold objects of dark magic and other dangerous magical artefacts. Borgin seemed to operate the shop mostly by himself, and it is unknown what happened to his co-owner Caractacus Burke. Borgin and Burkes was established in 1863, but it is unknown whether Borgin was one of the founders of the shop, and, if not, when he started working there. From the 1920s to the 1940s, Caractacus Burke seemed to have...", "thumbnail": "https://vignette.wikia.nocookie.net/harrypotter/images/3/39/Babcos.PNG/revision/latest/window-crop/width/200/x-offset/42/y-offset/0/window-width/239/window-height/238?cb=20090808113536", "title": "Borgin"}}