{"Josh Hoberman": {"abstract": "Josh Hoberman is one of the Physical Kids' closest friends and a talented magician in his own right. The east natural in his skills, Josh possessed an untapped power throughout his tenure at Brakebills, and grew close to Poppy during the course of the quest to restore. Not much is known about Josh previous to Brakebills, but, during his time there, he befriends Eliot and Janet, who are in the same year as he is and same discipline group. He struggles there due to the judgment of other...", "thumbnail": null, "title": "Josh Hoberman"}, "Van": {"abstract": "Melanie Van der Weghe is one of the professors in Brakebills. She is described as a stern woman in her forties with dark shoulder-length hair.", "thumbnail": null, "title": "Melanie Van der Weghe"}, "Richard": {"abstract": "Richard is a Physical Kid who graduated before the main five, but he lives with them all after they graduate. He also accompanies them to Fillory, but proves to be the cautious one. He is also the only Christian magician described in the novel, and there are hints that he and Janet Pluchinsky had a history together.", "thumbnail": null, "title": "Richard"}, "Greenstreet": {"abstract": "Emily Greenstreet is a former student at Brakebills. She was a friend of Charlie Quinn, before he became a Niffin, and was the lover of Professor Mayakovsky Emily was once a promising student at Brakebills University. While attending, she fell in love with one of the staff, Professor Mayakovsky. They had an ongoing student-teacher affair until Mayakovsky abruptly ended it. Devastated, Emily believed that if she made herself more beautiful she could win back Mayakovsky's affection. Her...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/e/e5/Emily_Greenstreet.jpg/revision/latest/window-crop/width/200/x-offset/51/y-offset/0/window-width/1081/window-height/1080?cb=20161105005953", "title": "Emily Greenstreet"}, "Fen": {"abstract": "Fen is Dint's partner and fellow guide. She does not use magic, but is instead a skilled fighter who uses a form of martial arts to defeat her foes. Short sturdy legs with bulgy eyes.", "thumbnail": null, "title": "Fen"}, "Quentin Coldwater": {"abstract": "Quentin Coldwater is a New York-based Magician and former king of Fillory. Upon his acceptance to Brakebills College for Magical Pedagogy, Quentin's life changed once he was introduced to magic, and the dangers that follow. When the story begins, Quentin is living in Brooklyn and preparing for a Princeton alumni interview with his childhood friends, Julia and James. After he finds the would-be interviewer dead, a piece of paper moved by the wind lures him to a hidden portal that brings him...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/e/e5/Quentin_Coldwater.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/500/window-height/500?cb=20141102054222", "title": "Quentin Coldwater"}, "Orloff": {"abstract": "Amanda Orloff was a skilled student at Brakebills. Amanda was a loud, bluff, broad-shouldered girl with straight hair.", "thumbnail": null, "title": "Amanda Orloff"}, "Weghe": {"abstract": "Professor Van Der Weghe was a professor at Brakebills University. Professor Van Der Weghe oversaw Julia Wicker when she failed to pass Brakebills' Entrance Exam, explaining to her that she lacked the the attributes of a proper Magician, and that he would be responsible for removing her memories of the school. Though Julia argued with their logic, he relented. Before removing her memories, Van der Weghe took a moment to sanitize his hands, allowing Julia the opportunity to mark her arm so she...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/a/a1/Professor_Van_Der_Weghe.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/833/window-height/833?cb=20161105000322", "title": "Van Der Weghe"}, "Helen Chatwin": {"abstract": "Helen Chatwin is one of the Chatwin Children, the central characters in Fillory and Further series. Along with her siblings, Helen was sent to her aunt's house, during World War I. During one of her aunt's parties, Martin and Fiona Chatwin went through a grandfather's clock to Fillory, a magical realm. Few moments later, they come back more fit and suntanned with different clothes and hair.", "thumbnail": null, "title": "Helen Chatwin"}, "Emily Greenstreet": {"abstract": "Emily Greenstreet was allegedly the first Brakebills student in one hundred and fifty years to willingly leave the school.", "thumbnail": null, "title": "Emily Greenstreet"}, "Bigby": {"abstract": "Bigby is one of the professors in Brakebills and the Physical Kids' unofficial faculty advisor. Bigby is a pixie with a human-like appearance, though short. She has two pairs of wings on his back that he usually keeps invisible.", "thumbnail": null, "title": "Bigby"}, "Mayakovsky": {"abstract": "Professor Mischa Mayakovsky is a powerful magician, and the Head of Brakebills South. Mischa Mayakovsky was once a respected professor at Brakebills North American campus. After a scandal involving his affair with a student, Emily Greenstreet, resulted in the apparent death of another student, Charlie Quinn, he was given a choice, retire in disgrace or transfer to Brakebills South.", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/8/8a/Mayakovsky.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/771/window-height/771?cb=20170513200219", "title": "Professor Mayakovsky"}, "Humbledrum": {"abstract": "Margo Hanson is one of the Physical Kids and one if the main characters of Syfy's The Magicians. The party animal of the group, Margo seems to be attached at the hip to Eliot. Margo is portrayed as both deeply insecure and surprisingly strong. She is outspoken and sometimes causes controversy, but is also fiercely loyal. To be added", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/a/a2/Magicians_S3_Promo_Mystical_Keys_09_Margo.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/641/window-height/640?cb=20180104003041", "title": "Margo Hanson"}, "Surendra": {"abstract": "Janet Pluchinsky is one of the Physical Kids, and a magician one year further than Quentin, who becomes one of the Queens of Fillory. Quentin met her for the first time in his third year, when entering The Cottage, describing her as lean, animated and the loud one. Janet was noticed by him earlier, when she hold forth to the others on walks through the Maze, and making speeches in dinner time.", "thumbnail": null, "title": "Janet Pluchinsky"}, "Lovelady": {"abstract": "abstract", "thumbnail": false, "title": "title"}, "Popper": {"abstract": "Amelia Popper was an 18th century Magician who became well renowned after publishing her book on practical exercises for Magicians.", "thumbnail": null, "title": "Amelia Popper"}, "Dean Fogg": {"abstract": "Henry Fogg is the dean of Brakebills and is shown to be alternatively severe, kind, wise, and cynical throughout the novels. His words often prove influential on Quentin's thinking. When Quentin was tested for Brakebills, Fogg almost rejected him until the former proved that he had latent magic in him. He has been noted to being powerful enough to notice magic on the caliber of a time loop, but not powerful enough to actual do anything about said time loop magic.", "thumbnail": null, "title": "Henry Fogg"}, "Chatwin": {"abstract": "The Chatwin Children are the five children featured in Christopher Plover's Fillory and Further book series where they travel to the magical land of Fillory. The children are Martin, Fiona, Rupert, Helen, and Jane.", "thumbnail": null, "title": "Chatwin Children"}, "Gretchen": {"abstract": "Denise Crosby is the actress who portrays Genji on The Magicians. Denise Michelle Crosby was born on November 24, 1957 in Hollywood, California, the out-of-wedlock daughter of Marilyn Scott and actor Dennis Crosby. Her mother pursued a sensational, three-year-long lawsuit against her father, at the conclusion of which he was ordered to pay child support and legal fees. This deeply embarrassed Dennis and his father, the actor and singer Bing Crosby. Although Crosby was 19 when her grandfather...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/e/e6/Denise_Crosby.png/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1200/window-height/1200?cb=20170520200718", "title": "Denise Crosby"}, "Fillory": {"abstract": "Fillory is a magical world written about in Christopher Plover's novels that turns out to be real. Fillory pertains not only to the mystical land as a whole, but also one of the realms present in it. It is bordered to the northwest by Loria. Fillory is populated with, among other things, talking animals such as horses and elephants, although the non-talking kind also exist. There are also magical beasts, such as pegasi, and a number of Unique Beasts. Other magical beings who live there are...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/2/24/Fillory_from_space.jpg/revision/latest/window-crop/width/200/x-offset/416/y-offset/0/window-width/1091/window-height/1090?cb=20161027194133", "title": "Fillory"}, "Brakebills": {"abstract": "Brakebills College for Magical Pedagogy (known as Brakebills University in the Syfy adaptation), or simply Brakebills, is the only magical school in North America. It is located somewhere in New York, along the Hudson river. Brakebills was founded around the 17th century. In the 1930s a demand for international learning lead to Brakebills importing professors from around the world. One of these professors was Dean Mayakovsky, the father of Professor Mayakovsky from Brakebills South.", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/b/b9/Brakebillscrest.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1500/window-height/1500?cb=20110716230629", "title": "Brakebills"}, "James": {"abstract": "James was Quentin's best friend and Julia's boyfriend in the beginning of The Magicians. He was unaware of magic and eventually broke up with Julia once she became obsessed with it. His mind was eventually erased of any knowledge of Julia's existence. James's appearance in the first book is described as having wavy chestnut hair and being shorter than Quentin but broader and more solidly built. He is wearing a camel cashmere coat which is wide open because he doesn't get cold.", "thumbnail": null, "title": "James"}, "Der": {"abstract": "Professor Van Der Weghe was a professor at Brakebills University. Professor Van Der Weghe oversaw Julia Wicker when she failed to pass Brakebills' Entrance Exam, explaining to her that she lacked the the attributes of a proper Magician, and that he would be responsible for removing her memories of the school. Though Julia argued with their logic, he relented. Before removing her memories, Van der Weghe took a moment to sanitize his hands, allowing Julia the opportunity to mark her arm so she...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/a/a1/Professor_Van_Der_Weghe.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/833/window-height/833?cb=20161105000322", "title": "Van Der Weghe"}, "Martin Chatwin": {"abstract": "Martin Chatwin is the eldest of the Chatwin Children, the central characters in the Fillory and Further series. Martin Chatwin was the eldest of the Chatwin Children. (In the show Rupert was the eldest and there only Rupert, Martin and Jane there were no more siblings) He was sent, along with his siblings, to his Aunt Maude's house, during World War I. During a party that Aunt Maude was hosting, he was attempting to understand a (possibly magical) grandfather clock, when He entered Fillory...", "thumbnail": null, "title": "Martin Chatwin"}, "Ember": {"abstract": "Ember is a ram who built and watches over Fillory along with his brother Umber. Ember looks like an enormous, golden ram.", "thumbnail": null, "title": "Ember"}, "Alice": {"abstract": "Alice Quinn is a talented and natural magician whom Quentin meets while attending Brakebills. They are in the same year, and they both study the same discipline once their specialty areas are decided. Alice is a rather classy dressed girl to go with her smarts with shoulder length black hair and blue eyes, she also wears glasses and a necklace that looks like a old fashioned pocket watch.", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/c/ca/Alice_Quinn2.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/500/window-height/500?cb=20160215033127", "title": "Alice Quinn"}, "Jane Chatwin": {"abstract": "Jane Chatwin is the youngest of the Chatwin Childen, After her brother stays in Fillory, Jane is called upon to bring him back, but she is unable to do it herself and ends up needing Quentin Coldwater's help. Jane first appears in The Magicians as the paramedic Quentin encounters in the house where he was supposed to have his alumni interview. She gives him the supposedly sixth book in the Fillory and Further series, which she herself wrote.", "thumbnail": null, "title": "Jane Chatwin"}, "Janet Way": {"abstract": "Janet Pluchinsky is one of the Physical Kids, and a magician one year further than Quentin, who becomes one of the Queens of Fillory. Quentin met her for the first time in his third year, when entering The Cottage, describing her as lean, animated and the loud one. Janet was noticed by him earlier, when she hold forth to the others on walks through the Maze, and making speeches in dinner time.", "thumbnail": null, "title": "Janet Pluchinsky"}, "Doris": {"abstract": "abstract", "thumbnail": false, "title": "title"}, "Plover": {"abstract": "Christopher Plover is the author of the Fillory and Further series. He lived in Cornwall, England. Christopher Plover and his sister were caretakers to the Chatwin children. After discovering Fillory, the children would share with Plover the stories of their adventures, and Plover eventually wrote and published them. Plover repeatedly sexually abused Martin Chatwin and was ultimately the reason for Martin giving up his shade and becoming the Beast.", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/e/ea/Screenshot_2018-01-11_at_7.58.44_AM.png/revision/latest/window-crop/width/200/x-offset/25/y-offset/0/window-width/208/window-height/207?cb=20180111125947", "title": "Christopher Plover"}, "Ana": {"abstract": "abstract", "thumbnail": false, "title": "title"}, "Farvel": {"abstract": "abstract", "thumbnail": false, "title": "title"}, "Penny": {"abstract": "Penny Adiyodi is a student who enters Brakebills at the same time as Alice Quinn and Quentin Coldwater. He is shown to be one of the three most adept magicians in that year, and begins to study very archaic and untested magic during his time at school. The novel later reveals that his real name is William. Penny is highly skilled and is shown to be capable of inventing new spells with Alice before the group enters Fillory. Despite his apparent skills, he has a hard time making friends and...", "thumbnail": null, "title": "Penny"}, "Julia": {"abstract": "Julia Ogden Wicker is a friend of Quentin. She dated Quentin's best friend James. Quentin stays loosely in touch with her throughout the novel as she goes through changes of her own. It turns out that Julia took the Brakebills examination, but failed. Although they were supposed to erase the memory, something went wrong and she remembers the missed opportunity, which takes a toll on the rest of her life. Julia is on the fast track to life. Unlike her best friend Quentin, she had all her life...", "thumbnail": null, "title": "Julia Wicker"}, "Jesus": {"abstract": "Hale Appleman (born 17 January 1986) is an American actor who portrays Eliot Waugh in The Magicians. He is also known for playing Tobey Cobb in the 2007 film Teeth. Appleman's credits on stage include the revival of Streamers at the Roundabout Theater Company, Clifford Odets' Paradise Lost at the American Repertory Theater, and the New York premiere of Passion Play as Jesus. In 2011, he played Bob in Moonchildren at the Berkshire Theatre Festival, and can be heard on the L.A. Theatre Works...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/6/6f/HaleApplemandb.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/666/window-height/666?cb=20161028231632", "title": "Hale Appleman"}, "Sunderland": {"abstract": "Pearl Sunderland is a magician and a professor at Brakebills University. Professor Sunderland first appeared when shown questioning Quentin Coldwater about the The Beast's attack, trying to get some useful information from him about the entity and the way in which he was able to access the school. Sunderland also questioned Kady about her knowledge of Battle Magic, a practice forbidden to Brakebills students since the dismissal of Professor Bigby. When she finished interviewing all the...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/3/39/Pearl_sunderland.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/1049/window-height/1049?cb=20161101231819", "title": "Pearl Sunderland"}, "Dint": {"abstract": "Dint is a resident of Fillory. He was one of the guides who lead the Physicals in the search for the legendary crown. He is also a mage and uses a wand to conduct his magic, something which the Physicals look down upon since they consider wands are only for beginners. They are surprised to see that Dint is actually quite adept when facing enemies along with his partner Fen.", "thumbnail": null, "title": "Dint"}, "Rupert": {"abstract": "Rupert John Chatwin was the youngest boy among the Chatwin Children. He later died as a soldier in World War II.", "thumbnail": null, "title": "Rupert Chatwin"}, "Eliot": {"abstract": "Eliot is one of the Physical Kids, and he is also a very talented magician, perhaps the most natural at Brakebills. He is the first person that Quentin Coldwater runs into when the latter comes across Brakebills for his examination. Eliot's sexuality is a minor plot point throughout the novel, as is his over-dependence on alcohol. He is seen to be the unofficial leader of the group of five (along with Quentin, Alice, Josh, and Janet) throughout the novel. He, Janet, and Josh are several...", "thumbnail": null, "title": "Eliot Waugh"}, "Eric": {"abstract": "Spencer Garrett Heckenkamp is the actor who portrays Ted Coldwater, Quentin's father on The Magicians. Born as Spencer Garrett Heckenkamp in Los Angeles, California to actress Kathleen Nolan and former head of the talent agency Film Artists Associates Richard Heckenkamp, he attended Duke University and Fordham University. He studied acting with Sanford Meisner at The Neighborhood Playhouse, Jeff Perry, Robert Neff Williams at The Juilliard School, and Alfred Molina. In 1996 he received a...", "thumbnail": "https://vignette.wikia.nocookie.net/themagicians/images/7/70/Spencer_Garrett.jpg/revision/latest/window-crop/width/200/x-offset/0/y-offset/0/window-width/666/window-height/666?cb=20161104041042", "title": "Spencer Garrett"}, "Amanda Orloff": {"abstract": "Amanda Orloff was a skilled student at Brakebills. Amanda was a loud, bluff, broad-shouldered girl with straight hair.", "thumbnail": null, "title": "Amanda Orloff"}}